Podkova/src/DataProcessors/РаботаСКМПриПеремаркировкеТоваровИСМП/РаботаСКМПриПеремаркировкеТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСКМПриПеремаркировкеТоваровИСМП</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйКодМаркировки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбранныйНовыйКодМаркировки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМаркировки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяНоменклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяСерия</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяХарактеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяХарактеристикаИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКодМаркировки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйСпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПеремаркировки</name>
    <type>
      <types>EnumRef.ПричиныПеремаркировкиТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВзятьИзПула</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СразуНаПринтер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИСМП</name>
    <type>
      <types>EnumRef.СтатусыОбработкиПеремаркировкиТоваровИСМП</types>
      <types>EnumRef.СтатусыОбработкиСписанияКодовМаркировкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикиИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>EnumRef.ШаблоныКодовМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>DefinedType.ШаблонЭтикеткиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркировкаОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокировкаРедактированияНовогоКода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокировкаРедактированияСтарогоКода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаСертификации</name>
    <type>
      <types>EnumRef.ВидыДокументовОбязательнойСертификацииИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаСертификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаСертификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сертификация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПервичногоДокумента</name>
    <type>
      <types>EnumRef.ВидыПервичныхДокументовИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DefinedType.ДокументПродажиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПервичногоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроизводства</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИсточник</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйКодМаркировки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Podkova/src/DataProcessors/РаботаСКМПриПеремаркировкеТоваровИСМП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТабличныйДокумент") Тогда
		
		Если Не ЭтоАдресВременногоХранилища(ПараметрыПечати.АдресВХранилище) Тогда
			Возврат;
		КонецЕсли;

		ТабличныйДокумент = ПолучитьИзВременногоХранилища(ПараметрыПечати.АдресВХранилище);
		
		Если ТабличныйДокумент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПроверкиИПодборКодовМаркировкиИСМП_ТабличныйДокумент";
			
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ТабличныйДокумент",
			НСтр("ru = 'Этикетки ИС МП'"),
			ТабличныйДокумент);
			
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииКомандПодключенныхКОбъекту(Команды) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Устанавливает связанные значения новому элементу справочник ШтрихкодыУпаковок при перемаркировке
// 
// Параметры:
// 	КодМаркировки - СправочникСсылка.ШтрихкодыУпаковок - Старый код маркировки
// 	НовыйКодМаркировки - СправочникСсылка.ШтрихкодыУпаковок - Новый код маркировки
Процедура УстановитьЗначенияНовогоКодаМаркировки(КодМаркировки, НовыйКодМаркировки) Экспорт
	
	ШтрихкодУпаковкиОбъект = НовыйКодМаркировки.ПолучитьОбъект();
	Если Не ШтрихкодУпаковкиОбъект.Серия = КодМаркировки.Серия Тогда
		ШтрихкодУпаковкиОбъект.Серия = КодМаркировки.Серия;
	КонецЕсли;
	Если ШтрихкодУпаковкиОбъект.Модифицированность() Тогда
		ШтрихкодУпаковкиОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
	
#КонецЕсли
